qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3/stm32f3xx_hal_hrtim.h
/** @brief  Clears the specified HRTIM common pending flag.
  * @param  __HANDLE__: specifies the HRTIM Handle.
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *        This parameter can be one of the following values:
  *            @arg HRTIM_IT_FLT1: Fault 1 interrupt clear flag
  *            @arg HRTIM_IT_FLT2: Fault 2 interrupt clear flag
  *            @arg HRTIM_IT_FLT3: Fault 3 clear flag
  *            @arg HRTIM_IT_FLT4: Fault 4 clear flag
  *            @arg HRTIM_IT_FLT5: Fault 5 clear flag
  *            @arg HRTIM_IT_SYSFLT: System Fault interrupt clear flag
  *            @arg HRTIM_IT_DLLRDY: DLL ready interrupt clear flag
  *            @arg HRTIM_IT_BMPER: Burst mode period interrupt clear flag
  * @retval None
  */
#define __HAL_HRTIM_CLEAR_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->sCommonRegs.ICR = (__INTERRUPT__)) 

/** @brief  Clears the specified HRTIM Master pending flag.
  * @param  __HANDLE__: specifies the HRTIM Handle.
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *        This parameter can be one of the following values:
  *            @arg HRTIM_MASTER_IT_MCMP1: Master compare 1 interrupt clear flag
  *            @arg HRTIM_MASTER_IT_MCMP2: Master compare 2 interrupt clear flag
  *            @arg HRTIM_MASTER_IT_MCMP3: Master compare 3 interrupt clear flag
  *            @arg HRTIM_MASTER_IT_MCMP4: Master compare 4 interrupt clear flag
  *            @arg HRTIM_MASTER_IT_MREP: Master Repetition interrupt clear flag
  *            @arg HRTIM_MASTER_IT_SYNC: Synchronization input interrupt clear flag
  *            @arg HRTIM_MASTER_IT_MUPD: Master update interrupt clear flag
  * @retval None
  */
#define __HAL_HRTIM_MASTER_CLEAR_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->sMasterRegs.MICR = (__INTERRUPT__)) 

/** @brief  Clears the specified HRTIM Timerx pending flag.
  * @param  __HANDLE__: specifies the HRTIM Handle.
  * @param  __TIMER__: specified the timing unit (Timer A to E)
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *        This parameter can be one of the following values:
  *            @arg HRTIM_TIM_IT_CMP1: Timer compare 1 interrupt clear flag
  *            @arg HRTIM_TIM_IT_CMP2: Timer compare 2 interrupt clear flag
  *            @arg HRTIM_TIM_IT_CMP3: Timer compare 3 interrupt clear flag
  *            @arg HRTIM_TIM_IT_CMP4: Timer compare 4 interrupt clear flag
  *            @arg HRTIM_TIM_IT_REP: Timer repetition interrupt clear flag
  *            @arg HRTIM_TIM_IT_UPD: Timer update interrupt clear flag
  *            @arg HRTIM_TIM_IT_CPT1: Timer capture 1 interrupt clear flag
  *            @arg HRTIM_TIM_IT_CPT2: Timer capture 2 interrupt clear flag
  *            @arg HRTIM_TIM_IT_SET1: Timer output 1 set interrupt clear flag
  *            @arg HRTIM_TIM_IT_RST1: Timer output 1 reset interrupt clear flag
  *            @arg HRTIM_TIM_IT_SET2: Timer output 2 set interrupt clear flag
  *            @arg HRTIM_TIM_IT_RST2: Timer output 2 reset interrupt clear flag
  *            @arg HRTIM_TIM_IT_RST: Timer reset interrupt clear flag
  *            @arg HRTIM_TIM_IT_DLYPRT: Timer output 1 delay protection interrupt clear flag
  * @retval None
  */
#define __HAL_HRTIM_TIMER_CLEAR_IT(__HANDLE__, __TIMER__, __INTERRUPT__)   ((__HANDLE__)->Instance->sTimerxRegs[(__TIMER__)].TIMxICR = (__INTERRUPT__)) 

/* DMA HANDLING */
/** @brief  Enables or disables the specified HRTIM common interrupts.
  * @param  __HANDLE__: specifies the HRTIM Handle.
  * @param  __INTERRUPT__: specifies the interrupt source to enable or disable.
  *        This parameter can be one of the following values:
  *            @arg HRTIM_IT_FLT1: Fault 1 interrupt enable
  *            @arg HRTIM_IT_FLT2: Fault 2 interrupt enable
  *            @arg HRTIM_IT_FLT3: Fault 3 interrupt enable
  *            @arg HRTIM_IT_FLT4: Fault 4 interrupt enable
  *            @arg HRTIM_IT_FLT5: Fault 5 interrupt enable
  *            @arg HRTIM_IT_SYSFLT: System Fault interrupt enable
  *            @arg HRTIM_IT_DLLRDY: DLL ready interrupt enable
  *            @arg HRTIM_IT_BMPER: Burst mode period interrupt enable
  * @retval None
  */
#define __HAL_HRTIM_ENABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->sCommonRegs.IER |= (__INTERRUPT__))
#define __HAL_HRTIM_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->sCommonRegs.IER &= ~(__INTERRUPT__))

/** @brief  Enables or disables the specified HRTIM Master timer DMA requets.
  * @param  __HANDLE__: specifies the HRTIM Handle.
  * @param  __DMA__: specifies the DMA request to enable or disable.
  *        This parameter can be one of the following values:
  *            @arg HRTIM_MASTER_DMA_MCMP1: Master compare 1 DMA resquest enable
  *            @arg HRTIM_MASTER_DMA_MCMP2: Master compare 2 DMA resquest enable
  *            @arg HRTIM_MASTER_DMA_MCMP3: Master compare 3 DMA resquest enable
  *            @arg HRTIM_MASTER_DMA_MCMP4: Master compare 4 DMA resquest enable
  *            @arg HRTIM_MASTER_DMA_MREP: Master Repetition DMA resquest enable
  *            @arg HRTIM_MASTER_DMA_SYNC: Synchronization input DMA resquest enable
  *            @arg HRTIM_MASTER_DMA_MUPD: Master update DMA resquest enable
  * @retval None
  */
#define __HAL_HRTIM_MASTER_ENABLE_DMA(__HANDLE__, __DMA__)   ((__HANDLE__)->Instance->sMasterRegs.MDIER |= (__DMA__))
#define __HAL_HRTIM_MASTER_DISABLE_DMA(__HANDLE__, __DMA__) ((__HANDLE__)->Instance->sMasterRegs.MDIER &= ~(__DMA__))

/** @brief  Enables or disables the specified HRTIM Timerx DMA requests.
  * @param  __HANDLE__: specifies the HRTIM Handle.
  * @param  __TIMER__: specified the timing unit (Timer A to E)
  * @param  __DMA__: specifies the DMA request to enable or disable.
  *        This parameter can be one of the following values:
  *            @arg HRTIM_TIM_DMA_CMP1: Timer compare 1 DMA resquest enable
  *            @arg HRTIM_TIM_DMA_CMP2: Timer compare 2 DMA resquest enable
  *            @arg HRTIM_TIM_DMA_CMP3: Timer compare 3 DMA resquest enable
  *            @arg HRTIM_TIM_DMA_CMP4: Timer compare 4 DMA resquest enable
  *            @arg HRTIM_TIM_DMA_REP: Timer repetition DMA resquest enable
  *            @arg HRTIM_TIM_DMA_UPD: Timer update DMA resquest enable
  *            @arg HRTIM_TIM_DMA_CPT1: Timer capture 1 DMA resquest enable
  *            @arg HRTIM_TIM_DMA_CPT2: Timer capture 2 DMA resquest enable
  *            @arg HRTIM_TIM_DMA_SET1: Timer output 1 set DMA resquest enable
  *            @arg HRTIM_TIM_DMA_RST1: Timer output 1 reset DMA resquest enable
  *            @arg HRTIM_TIM_DMA_SET2: Timer output 2 set DMA resquest enable
  *            @arg HRTIM_TIM_DMA_RST2: Timer output 2 reset DMA resquest enable
  *            @arg HRTIM_TIM_DMA_RST: Timer reset DMA resquest enable
  *            @arg HRTIM_TIM_DMA_DLYPRT: Timer delay protection DMA resquest enable
  * @retval None
  */
#define __HAL_HRTIM_TIMER_ENABLE_DMA(__HANDLE__, __TIMER__, __DMA__)   ((__HANDLE__)->Instance->sTimerxRegs[(__TIMER__)].TIMxDIER |= (__DMA__))
#define __HAL_HRTIM_TIMER_DISABLE_DMA(__HANDLE__, __TIMER__, __DMA__) ((__HANDLE__)->Instance->sTimerxRegs[(__TIMER__)].TIMxDIER &= ~(__DMA__))

